// Семинар 1. ДЗ. Задача №8.
// Напишите программу, которая на вход принимает число (N), 
//а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

Console.WriteLine("Найти все четные числа от 1 до N?");
Console.WriteLine();

Console.Write("Введите значение окончания поиска N - ");
//int N = Convert.ToInt32(Console.ReadLine());
double N = Convert.ToDouble(Console.ReadLine());
Console.Write("Введите значение начала поиска x - ");
double x = Convert.ToDouble(Console.ReadLine());
//int z = 1;
Console.WriteLine();
Console.WriteLine($"Последнее значение поиска N = {N}");
Console.WriteLine($"Начальное число поиска x = {x}");
//Console.WriteLine($"Индекс значения первого результа z = {z}");
Console.WriteLine();
// numbers.Add(что то) - добавление в список
//double n;
//List<n> numbers = new List<n>();
//for (x = 1; x <= N; x++)
//{
//double b = x / 2;
//double c = b % 1;
//        //bool i => i% 2 == 0 = int.TryParse(Console.ReadLine(), out n);
//    if (c == 0)
//    {
//        numbers.Add(n);
//    }
//    }
//Console.Write(List<n>, n);
//class System{}.Collections.Generic.List<T>;

while (x <= N)
{
    if (true)
    {
        
    }
    
}